app/views/users/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."user_id" = ? ORDER BY "books"."id" DESC  [["user_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 19]]
---
        <td><%= book.body %></td>
        <td><%= "コメント数:#{book.book_comments.count}" %></td>