app/views/books/index.html.erb

                <p><%= link_to book_favorites_path(book), method: :delete, class:"text-danger" do %>
                  ♥<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 5]]

                <p><%= link_to book_favorites_path(book), method: :post do %>
                  ♡<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 14]]

        <div>
         <td><%= "コメント数:#{book.book_comments.count}" %></td>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]