app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["user_id", 1], ["created_at", "2021-11-02 03:25:23.016658"], ["updated_at", "2021-11-02 03:25:23.016658"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    @user = current_user
    if @book.save
      redirect_to book_path(@book.id)
      flash[:notice] = "Book was successfully created."
    else
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "aaa"], ["updated_at", "2021-10-26 00:38:40.970653"], ["id", 12]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 15]]
---
  def destroy
    @book = Book.find(params[:id])
    @book.destroy

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def correct_user
    @book = Book.find(params[:id])