app/controllers/users_controller.rb

    def update
    @user = User.find(params[:id])
     if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "8d53e6dc025e07f0b7b2b301e042e8cef1ef63038b972e0cd7bcf9f7ecc2"], ["updated_at", "2021-11-03 05:19:59.680764"], ["id", 1]]